nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/eiq_examples/mpp/inc/cm33_core1/pin_mux.h
/*
 * Copyright 2024-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/* IOPCTL1 pin drive strength macros */
#define IOPCTL_PIO_FUNC0                 0x00U
#define IOPCTL_PIO_FUNC1                 0x01U
#define IOPCTL_PIO_PUPD_DI               0x00U
#define IOPCTL_PIO_PUPD_EN               0x10U
#define IOPCTL_PIO_PULLDOWN_EN           0x00U
#define IOPCTL_PIO_PULLUP_EN             0x20U
#define IOPCTL_PIO_INBUF_DI              0x00U
#define IOPCTL_PIO_INBUF_EN              0x40U
#define IOPCTL_PIO_SLEW_RATE_NORMAL      0x00U
#define IOPCTL_PIO_DRIVE_100OHM          0x000U
#define IOPCTL_PIO_DRIVE_66OHM           0x100U
#define IOPCTL_PIO_DRIVE_50OHM           0x200U
#define IOPCTL_PIO_DRIVE_33OHM           0x300U
#define IOPCTL_PIO_ANAMUX_DI             0x000U
#define IOPCTL_PIO_PSEDRAIN_DI           0x000U
#define IOPCTL_PIO_INV_DI                0x000U

/*!
 * @brief Calls initialization functions.
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures UART (LP_FLEXCOMM19) pins for core1 debug console.
 * PIO8_14 (RX), PIO8_15 (TX).
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */
